num1=int(input('Please enter first number:'))
num2=int(input('Please enter second number:'))
num3=int(input('Please enter third number:'))
num4=int(input('Please enter fourth number:'))
 #ამ კოდში ცვლადში ვათავსებთ inputs, ტექსტურ მონაცემს რომ მომხმარებლისთვის არ იყოს დამაბნეველი და integer ვაყოლებთ წინ რომ ტერმინალში მოთავსებული რიცხვები კომპიუტერმა აღიქვას როგორც რიცხვებათ და არა სიმბოლოებად რომ შემდეგ შევასრულოთ არითმეტიკული მოქმედებები.

print('addition results:',num1 + num2 + num3 + num4)
print('substraction results:',num1 - num2 - num3 - num4)
print('multiplication results:',num1 * num2 * num3 * num4)
print('division results:',num1 / num2 / num3 / num4)
 #ამ კოდში ვიყენებთ არითმეტიკული მოქმედებების ოპერაციებს და წინ ვაყოლებთ string ტექსტს როგორც წინა კოდში რომ მომხმარებლისთვის უფრო კომფორტული და ადვილი მოსახმარი იყოს

print('the first number is more than the second number:',num1>num2)
 #ამ კოდში ვიყენებთ შედარების ოპერატორებს რომელიც გვიდასტურებს თუ არის ეს შედარება სწორი.



#input და output არის კომუნიკაციის საშუალება დიგიტალურ და რეალურ სამყაროს შორის.
#inputით შეგვიძლია კომიუტერს ვუბრძანოთ ფიზიკური მოქმედებებით მაგალითად მაუსის დაკლიკებით რო რაიმე კონკრეტული მოქმედება შეასრულოს და ინფორმაცია გადასცეს როგორიცაა კურსორის გადაადგილება კლავიატურით კომპიუტერში სიმბოლოების წერა და ა.შ.
#outputი არის როცა კომპიუტერი რაიმე სახით ინფორმაციას გადმოგვცემს მაგალითად მონიტორზე ასახვით სპიკერებიდან ხმების გამოცემით და ა.შ.
#არის ასევე მოწყობილობები რომლებსაც აქვთ ორივეს ფუნქცია როგორიცაა usb დრაივები თვითონ ამ მოწყობილობაზე შეგვიძლია მოვათავსოთ და ასევე განვათავსოთ ინფორმაცია კომპიუტერებზე.
