print(1+1)
print(2-1)
print(2*2)
print(4/2)
 #აქ ვბეჭდავთ არითმეტიკულს გამოთვლებს.

print("he"+"llo")
 #ორი ტექსტური მონაცემის (სტრინგის) გაერთიანების შედეგად თავისთავად მივიღეთ გაერთიანებული ტექსტური მონაცემი "hello".

 #ტერმინალი სახავს გაშვებულ ბრძანებებს და ის გვჭირდება იმისთვის რომ შევამოწმოთ შიგადაშიგ კოდი როგორო მოქმედებს და თუ რაიმე შეფერხება (ერორი) არის კოდში.

 #სტრინგი არის ტექსტური მონაცემი რომელიც წარმოადგენს ნებისმიერ რიცხვს ასოს და ა.შ. როგორც სიმბოლოდ.
apple=(10)
banana=(5)
print(apple+banana)
 #შედეგად ვიღებთ ამ ორი ხილის ჯამს. 15 მივიღეთ რადგან კომპიუტერი აღიქვამს "apple"ს და "banana"ს როგორც შემდეგ მოცემულ რიცხვებს ცვლადი არის ეს ორი სიტყვა ხოლო რიცხვები კი ეგრეთწოდებული "value", ცვლადები მოკლედ რო ვთქვათ შემდეგ მოცემულ ინფორმაციას (values) ინახავს ზომის დამიუხედავად და გვეხმარება ამ ინფორმაციის სხვადასხვა კოდის ხაზზე ამობეჭდვაში.

 #აქ მე განზრახვით დავუშვი შეცდომა როგორც ბატონმა ლუკამ გვთხოვა საშინაოსთვის. ეს კოდი იმიტო ვერ ამოიბეჭდა ტერმინალზე რადგან კოდი არასწორი იყო სტრინგი ვერ შედგა ბრჭყალების გარეშე და ესე ვთქვათ პითონმა იგი ვერ გადათარგმნა კომპიუტერის გასაგებ ენაზე რომ მას იგი ამოებეჭდა.
print(error)